ecoins1994/0010_GitHub_EIS/RT_HW_0100_Library/RT_HW_00_BASE_v1.70_01.01.24/src/BASE_000_Reference/0120_C++_board.txt/0104_ESP32_board.txt/boards.txt
esp32.menu.FlashFreq.80=80MHz
esp32.menu.FlashFreq.80.build.flash_freq=80m
esp32.menu.FlashFreq.40=40MHz
esp32.menu.FlashFreq.40.build.flash_freq=40m

esp32.menu.FlashSize.4M=4MB (32Mb)
esp32.menu.FlashSize.4M.build.flash_size=4MB
esp32.menu.FlashSize.8M=8MB (64Mb)
esp32.menu.FlashSize.8M.build.flash_size=8MB
esp32.menu.FlashSize.8M.build.partitions=default_8MB
esp32.menu.FlashSize.2M=2MB (16Mb)
esp32.menu.FlashSize.2M.build.flash_size=2MB
esp32.menu.FlashSize.2M.build.partitions=minimal
esp32.menu.FlashSize.16M=16MB (128Mb)
esp32.menu.FlashSize.16M.build.flash_size=16MB

esp32.menu.UploadSpeed.921600=921600
esp32.menu.UploadSpeed.921600.upload.speed=921600
esp32.menu.UploadSpeed.115200=115200
esp32.menu.UploadSpeed.115200.upload.speed=115200
esp32.menu.UploadSpeed.256000.windows=256000
esp32.menu.UploadSpeed.256000.upload.speed=256000
esp32.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32.menu.UploadSpeed.230400=230400
esp32.menu.UploadSpeed.230400.upload.speed=230400
esp32.menu.UploadSpeed.460800.linux=460800
esp32.menu.UploadSpeed.460800.macosx=460800
esp32.menu.UploadSpeed.460800.upload.speed=460800
esp32.menu.UploadSpeed.512000.windows=512000
esp32.menu.UploadSpeed.512000.upload.speed=512000

esp32.menu.LoopCore.1=Core 1
esp32.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32.menu.LoopCore.0=Core 0
esp32.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

esp32.menu.EventsCore.1=Core 1
esp32.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
esp32.menu.EventsCore.0=Core 0
esp32.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

esp32.menu.DebugLevel.none=None
esp32.menu.DebugLevel.none.build.code_debug=0
esp32.menu.DebugLevel.error=Error
esp32.menu.DebugLevel.error.build.code_debug=1
esp32.menu.DebugLevel.warn=Warn
esp32.menu.DebugLevel.warn.build.code_debug=2
esp32.menu.DebugLevel.info=Info
esp32.menu.DebugLevel.info.build.code_debug=3
esp32.menu.DebugLevel.debug=Debug
esp32.menu.DebugLevel.debug.build.code_debug=4
esp32.menu.DebugLevel.verbose=Verbose
esp32.menu.DebugLevel.verbose.build.code_debug=5

esp32.menu.EraseFlash.none=Disabled
esp32.menu.EraseFlash.none.upload.erase_cmd=
esp32.menu.EraseFlash.all=Enabled
esp32.menu.EraseFlash.all.upload.erase_cmd=-e

###############################################################
#					ESP32S  Dev Module BlueTooth EIS
###############################################################
esp32_bth.name=ESP32S  Dev Module BlueTooth EIS

esp32_bth.bootloader.tool=esptool_py
esp32_bth.bootloader.tool.default=esptool_py

esp32_bth.upload.tool=esptool_py
esp32_bth.upload.tool.default=esptool_py
esp32_bth.upload.tool.network=esp_ota

esp32_bth.upload.maximum_size=1310720
esp32_bth.upload.maximum_data_size=327680
esp32_bth.upload.flags=
esp32_bth.upload.extra_flags=

esp32_bth.serial.disableDTR=true
esp32_bth.serial.disableRTS=true

esp32_bth.build.tarch=xtensa
esp32_bth.build.bootloader_addr=0x1000
esp32_bth.build.target=esp32
esp32_bth.build.mcu=esp32
esp32_bth.build.core=esp32
esp32_bth.build.variant=esp32
esp32_bth.build.board=ESP32S_DEV_BTH_EIS

esp32_bth.build.f_cpu=240000000L
esp32_bth.build.flash_size=4MB
esp32_bth.build.flash_freq=40m
esp32_bth.build.flash_mode=dio
esp32_bth.build.boot=dio
esp32_bth.build.partitions=default
esp32_bth.build.defines=
esp32_bth.build.loop_core=
esp32_bth.build.event_core=

esp32_bth.menu.PSRAM.disabled=Disabled
esp32_bth.menu.PSRAM.disabled.build.defines=
esp32_bth.menu.PSRAM.disabled.build.extra_libs=
esp32_bth.menu.PSRAM.enabled=Enabled
esp32_bth.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
esp32_bth.menu.PSRAM.enabled.build.extra_libs=

esp32_bth.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32_bth.menu.PartitionScheme.default.build.partitions=default
esp32_bth.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32_bth.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32_bth.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32_bth.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32_bth.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32_bth.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32_bth.menu.PartitionScheme.minimal.build.partitions=minimal
esp32_bth.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32_bth.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32_bth.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32_bth.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32_bth.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32_bth.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32_bth.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32_bth.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32_bth.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32_bth.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32_bth.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32_bth.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32_bth.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32_bth.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32_bth.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32_bth.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32_bth.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32_bth.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32_bth.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32_bth.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32_bth.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32_bth.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32_bth.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32_bth.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
esp32_bth.menu.PartitionScheme.rainmaker=RainMaker
esp32_bth.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32_bth.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

esp32_bth.menu.CPUFreq.240=240MHz (WiFi/BT)
esp32_bth.menu.CPUFreq.240.build.f_cpu=240000000L
esp32_bth.menu.CPUFreq.160=160MHz (WiFi/BT)
esp32_bth.menu.CPUFreq.160.build.f_cpu=160000000L
esp32_bth.menu.CPUFreq.80=80MHz (WiFi/BT)
esp32_bth.menu.CPUFreq.80.build.f_cpu=80000000L
esp32_bth.menu.CPUFreq.40=40MHz (40MHz XTAL)
esp32_bth.menu.CPUFreq.40.build.f_cpu=40000000L
esp32_bth.menu.CPUFreq.26=26MHz (26MHz XTAL)
esp32_bth.menu.CPUFreq.26.build.f_cpu=26000000L
esp32_bth.menu.CPUFreq.20=20MHz (40MHz XTAL)
esp32_bth.menu.CPUFreq.20.build.f_cpu=20000000L
esp32_bth.menu.CPUFreq.13=13MHz (26MHz XTAL)
esp32_bth.menu.CPUFreq.13.build.f_cpu=13000000L
esp32_bth.menu.CPUFreq.10=10MHz (40MHz XTAL)
esp32_bth.menu.CPUFreq.10.build.f_cpu=10000000L

