ecoins1994/0010_GitHub_EIS/RT_HW_0100_Library/RT_HW_00_BASE_v1.70_01.01.24/src/BASE_000_Reference/0120_C++_board.txt/0104_ESP32_board.txt/boards.txt
esp32_bth.menu.FlashMode.qio=QIO
esp32_bth.menu.FlashMode.qio.build.flash_mode=dio
esp32_bth.menu.FlashMode.qio.build.boot=qio
esp32_bth.menu.FlashMode.dio=DIO
esp32_bth.menu.FlashMode.dio.build.flash_mode=dio
esp32_bth.menu.FlashMode.dio.build.boot=dio
esp32_bth.menu.FlashMode.qout=QOUT
esp32_bth.menu.FlashMode.qout.build.flash_mode=dout
esp32_bth.menu.FlashMode.qout.build.boot=qout
esp32_bth.menu.FlashMode.dout=DOUT
esp32_bth.menu.FlashMode.dout.build.flash_mode=dout
esp32_bth.menu.FlashMode.dout.build.boot=dout

esp32_bth.menu.FlashFreq.80=80MHz
esp32_bth.menu.FlashFreq.80.build.flash_freq=80m
esp32_bth.menu.FlashFreq.40=40MHz
esp32_bth.menu.FlashFreq.40.build.flash_freq=40m

esp32_bth.menu.FlashSize.4M=4MB (32Mb)
esp32_bth.menu.FlashSize.4M.build.flash_size=4MB
esp32_bth.menu.FlashSize.8M=8MB (64Mb)
esp32_bth.menu.FlashSize.8M.build.flash_size=8MB
esp32_bth.menu.FlashSize.8M.build.partitions=default_8MB
esp32_bth.menu.FlashSize.2M=2MB (16Mb)
esp32_bth.menu.FlashSize.2M.build.flash_size=2MB
esp32_bth.menu.FlashSize.2M.build.partitions=minimal
esp32_bth.menu.FlashSize.16M=16MB (128Mb)
esp32_bth.menu.FlashSize.16M.build.flash_size=16MB

esp32_bth.menu.UploadSpeed.921600=921600
esp32_bth.menu.UploadSpeed.921600.upload.speed=921600
esp32_bth.menu.UploadSpeed.115200=115200
esp32_bth.menu.UploadSpeed.115200.upload.speed=115200
esp32_bth.menu.UploadSpeed.256000.windows=256000
esp32_bth.menu.UploadSpeed.256000.upload.speed=256000
esp32_bth.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32_bth.menu.UploadSpeed.230400=230400
esp32_bth.menu.UploadSpeed.230400.upload.speed=230400
esp32_bth.menu.UploadSpeed.460800.linux=460800
esp32_bth.menu.UploadSpeed.460800.macosx=460800
esp32_bth.menu.UploadSpeed.460800.upload.speed=460800
esp32_bth.menu.UploadSpeed.512000.windows=512000
esp32_bth.menu.UploadSpeed.512000.upload.speed=512000

esp32_bth.menu.LoopCore.1=Core 1
esp32_bth.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
esp32_bth.menu.LoopCore.0=Core 0
esp32_bth.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

esp32_bth.menu.EventsCore.1=Core 1
esp32_bth.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
esp32_bth.menu.EventsCore.0=Core 0
esp32_bth.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

esp32_bth.menu.DebugLevel.none=None
esp32_bth.menu.DebugLevel.none.build.code_debug=0
esp32_bth.menu.DebugLevel.error=Error
esp32_bth.menu.DebugLevel.error.build.code_debug=1
esp32_bth.menu.DebugLevel.warn=Warn
esp32_bth.menu.DebugLevel.warn.build.code_debug=2
esp32_bth.menu.DebugLevel.info=Info
esp32_bth.menu.DebugLevel.info.build.code_debug=3
esp32_bth.menu.DebugLevel.debug=Debug
esp32_bth.menu.DebugLevel.debug.build.code_debug=4
esp32_bth.menu.DebugLevel.verbose=Verbose
esp32_bth.menu.DebugLevel.verbose.build.code_debug=5

esp32_bth.menu.EraseFlash.none=Disabled
esp32_bth.menu.EraseFlash.none.upload.erase_cmd=
esp32_bth.menu.EraseFlash.all=Enabled
esp32_bth.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
#                ESP32C3 STAMP-C3 EIS
##############################################################
eis_stamp_c3.name=ESP32C3 STAMP-C3 EIS
eis_stamp_c3.vid.0=0x303a
eis_stamp_c3.pid.0=0x1001

eis_stamp_c3.bootloader.tool=esptool_py
eis_stamp_c3.bootloader.tool.default=esptool_py

eis_stamp_c3.upload.tool=esptool_py
eis_stamp_c3.upload.tool.default=esptool_py
eis_stamp_c3.upload.tool.network=esp_ota

eis_stamp_c3.upload.maximum_size=1310720
eis_stamp_c3.upload.maximum_data_size=327680
eis_stamp_c3.upload.flags=
eis_stamp_c3.upload.extra_flags=
eis_stamp_c3.upload.use_1200bps_touch=false
eis_stamp_c3.upload.wait_for_upload_port=false

eis_stamp_c3.serial.disableDTR=false
eis_stamp_c3.serial.disableRTS=false

eis_stamp_c3.build.tarch=riscv32
eis_stamp_c3.build.target=esp
eis_stamp_c3.build.mcu=esp32c3
eis_stamp_c3.build.core=esp32
eis_stamp_c3.build.variant=esp32c3
eis_stamp_c3.build.board=ESP32C3_STAMP_C3_EIS
eis_stamp_c3.build.bootloader_addr=0x0

eis_stamp_c3.build.cdc_on_boot=0
eis_stamp_c3.build.f_cpu=160000000L
eis_stamp_c3.build.flash_size=4MB
eis_stamp_c3.build.flash_freq=80m
eis_stamp_c3.build.flash_mode=qio
eis_stamp_c3.build.boot=qio
eis_stamp_c3.build.partitions=default
eis_stamp_c3.build.defines=

eis_stamp_c3.menu.CDCOnBoot.default=Disabled
eis_stamp_c3.menu.CDCOnBoot.default.build.cdc_on_boot=0
eis_stamp_c3.menu.CDCOnBoot.cdc=Enabled
eis_stamp_c3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

eis_stamp_c3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
eis_stamp_c3.menu.PartitionScheme.default.build.partitions=default
eis_stamp_c3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
eis_stamp_c3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
eis_stamp_c3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
eis_stamp_c3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
eis_stamp_c3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
eis_stamp_c3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
eis_stamp_c3.menu.PartitionScheme.minimal.build.partitions=minimal
eis_stamp_c3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
eis_stamp_c3.menu.PartitionScheme.no_ota.build.partitions=no_ota
eis_stamp_c3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
eis_stamp_c3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
eis_stamp_c3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
eis_stamp_c3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
eis_stamp_c3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
eis_stamp_c3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
eis_stamp_c3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
eis_stamp_c3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
eis_stamp_c3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
eis_stamp_c3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
eis_stamp_c3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
eis_stamp_c3.menu.PartitionScheme.huge_app.build.partitions=huge_app
eis_stamp_c3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
eis_stamp_c3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
eis_stamp_c3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
eis_stamp_c3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
eis_stamp_c3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
eis_stamp_c3.menu.PartitionScheme.fatflash.build.partitions=ffat
eis_stamp_c3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
eis_stamp_c3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
eis_stamp_c3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
eis_stamp_c3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
eis_stamp_c3.menu.PartitionScheme.rainmaker=RainMaker
eis_stamp_c3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
eis_stamp_c3.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

eis_stamp_c3.menu.CPUFreq.160=160MHz (WiFi)
eis_stamp_c3.menu.CPUFreq.160.build.f_cpu=160000000L
eis_stamp_c3.menu.CPUFreq.80=80MHz (WiFi)
eis_stamp_c3.menu.CPUFreq.80.build.f_cpu=80000000L
eis_stamp_c3.menu.CPUFreq.40=40MHz
eis_stamp_c3.menu.CPUFreq.40.build.f_cpu=40000000L
eis_stamp_c3.menu.CPUFreq.20=20MHz
eis_stamp_c3.menu.CPUFreq.20.build.f_cpu=20000000L
eis_stamp_c3.menu.CPUFreq.10=10MHz
eis_stamp_c3.menu.CPUFreq.10.build.f_cpu=10000000L

eis_stamp_c3.menu.FlashMode.qio=QIO
eis_stamp_c3.menu.FlashMode.qio.build.flash_mode=dio
eis_stamp_c3.menu.FlashMode.qio.build.boot=qio
eis_stamp_c3.menu.FlashMode.dio=DIO
eis_stamp_c3.menu.FlashMode.dio.build.flash_mode=dio
eis_stamp_c3.menu.FlashMode.dio.build.boot=dio
eis_stamp_c3.menu.FlashMode.qout=QOUT
eis_stamp_c3.menu.FlashMode.qout.build.flash_mode=dout
eis_stamp_c3.menu.FlashMode.qout.build.boot=qout
eis_stamp_c3.menu.FlashMode.dout=DOUT
eis_stamp_c3.menu.FlashMode.dout.build.flash_mode=dout
eis_stamp_c3.menu.FlashMode.dout.build.boot=dout

eis_stamp_c3.menu.FlashFreq.80=80MHz
eis_stamp_c3.menu.FlashFreq.80.build.flash_freq=80m
eis_stamp_c3.menu.FlashFreq.40=40MHz
eis_stamp_c3.menu.FlashFreq.40.build.flash_freq=40m

eis_stamp_c3.menu.FlashSize.4M=4MB (32Mb)
eis_stamp_c3.menu.FlashSize.4M.build.flash_size=4MB
eis_stamp_c3.menu.FlashSize.8M=8MB (64Mb)
eis_stamp_c3.menu.FlashSize.8M.build.flash_size=8MB
eis_stamp_c3.menu.FlashSize.8M.build.partitions=default_8MB
eis_stamp_c3.menu.FlashSize.2M=2MB (16Mb)
eis_stamp_c3.menu.FlashSize.2M.build.flash_size=2MB
eis_stamp_c3.menu.FlashSize.2M.build.partitions=minimal
eis_stamp_c3.menu.FlashSize.16M=16MB (128Mb)
eis_stamp_c3.menu.FlashSize.16M.build.flash_size=16MB

eis_stamp_c3.menu.UploadSpeed.921600=921600
eis_stamp_c3.menu.UploadSpeed.921600.upload.speed=921600
eis_stamp_c3.menu.UploadSpeed.115200=115200
eis_stamp_c3.menu.UploadSpeed.115200.upload.speed=115200
eis_stamp_c3.menu.UploadSpeed.256000.windows=256000
eis_stamp_c3.menu.UploadSpeed.256000.upload.speed=256000
eis_stamp_c3.menu.UploadSpeed.230400.windows.upload.speed=256000
eis_stamp_c3.menu.UploadSpeed.230400=230400
eis_stamp_c3.menu.UploadSpeed.230400.upload.speed=230400
eis_stamp_c3.menu.UploadSpeed.460800.linux=460800
eis_stamp_c3.menu.UploadSpeed.460800.macosx=460800
eis_stamp_c3.menu.UploadSpeed.460800.upload.speed=460800
eis_stamp_c3.menu.UploadSpeed.512000.windows=512000
eis_stamp_c3.menu.UploadSpeed.512000.upload.speed=512000

