ecoins1994/0010_GitHub_EIS/RT_HW_0100_Library/RT_HW_00_BASE_v1.70_01.01.24/src/BASE_000_Reference/0120_C++_board.txt/0104_ESP32_board.txt/boards.txt
eis_stamp_c3.menu.DebugLevel.none=None
eis_stamp_c3.menu.DebugLevel.none.build.code_debug=0
eis_stamp_c3.menu.DebugLevel.error=Error
eis_stamp_c3.menu.DebugLevel.error.build.code_debug=1
eis_stamp_c3.menu.DebugLevel.warn=Warn
eis_stamp_c3.menu.DebugLevel.warn.build.code_debug=2
eis_stamp_c3.menu.DebugLevel.info=Info
eis_stamp_c3.menu.DebugLevel.info.build.code_debug=3
eis_stamp_c3.menu.DebugLevel.debug=Debug
eis_stamp_c3.menu.DebugLevel.debug.build.code_debug=4
eis_stamp_c3.menu.DebugLevel.verbose=Verbose
eis_stamp_c3.menu.DebugLevel.verbose.build.code_debug=5

eis_stamp_c3.menu.EraseFlash.none=Disabled
eis_stamp_c3.menu.EraseFlash.none.upload.erase_cmd=
eis_stamp_c3.menu.EraseFlash.all=Enabled
eis_stamp_c3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
#                 ESP32C3 STAMP-C3U EIS
##############################################################
eis_stamp_c3u.name=ESP32C3 STAMP-C3U EIS
eis_stamp_c3u.vid.0=0x303a
eis_stamp_c3u.pid.0=0x1001

eis_stamp_c3u.bootloader.tool=esptool_py
eis_stamp_c3u.bootloader.tool.default=esptool_py

eis_stamp_c3u.upload.tool=esptool_py
eis_stamp_c3u.upload.tool.default=esptool_py
eis_stamp_c3u.upload.tool.network=esp_ota

eis_stamp_c3u.upload.maximum_size=1310720
eis_stamp_c3u.upload.maximum_data_size=327680
eis_stamp_c3u.upload.flags=
eis_stamp_c3u.upload.extra_flags=
eis_stamp_c3u.upload.use_1200bps_touch=false
eis_stamp_c3u.upload.wait_for_upload_port=false

eis_stamp_c3u.serial.disableDTR=false
eis_stamp_c3u.serial.disableRTS=false

eis_stamp_c3u.build.tarch=riscv32
eis_stamp_c3u.build.target=esp
eis_stamp_c3u.build.mcu=esp32c3
eis_stamp_c3u.build.core=esp32
eis_stamp_c3u.build.variant=esp32c3
eis_stamp_c3u.build.board=ESP32C3_STAMP_C3U_EIS
eis_stamp_c3u.build.bootloader_addr=0x0

eis_stamp_c3u.build.cdc_on_boot=0
eis_stamp_c3u.build.f_cpu=160000000L
eis_stamp_c3u.build.flash_size=4MB
eis_stamp_c3u.build.flash_freq=80m
eis_stamp_c3u.build.flash_mode=qio
eis_stamp_c3u.build.boot=qio
eis_stamp_c3u.build.partitions=default
eis_stamp_c3u.build.defines=

eis_stamp_c3u.menu.CDCOnBoot.default=Disabled
eis_stamp_c3u.menu.CDCOnBoot.default.build.cdc_on_boot=0
eis_stamp_c3u.menu.CDCOnBoot.cdc=Enabled
eis_stamp_c3u.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

eis_stamp_c3u.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
eis_stamp_c3u.menu.PartitionScheme.default.build.partitions=default
eis_stamp_c3u.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
eis_stamp_c3u.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
eis_stamp_c3u.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
eis_stamp_c3u.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
eis_stamp_c3u.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
eis_stamp_c3u.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
eis_stamp_c3u.menu.PartitionScheme.minimal.build.partitions=minimal
eis_stamp_c3u.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
eis_stamp_c3u.menu.PartitionScheme.no_ota.build.partitions=no_ota
eis_stamp_c3u.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
eis_stamp_c3u.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
eis_stamp_c3u.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
eis_stamp_c3u.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
eis_stamp_c3u.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
eis_stamp_c3u.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
eis_stamp_c3u.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
eis_stamp_c3u.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
eis_stamp_c3u.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
eis_stamp_c3u.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
eis_stamp_c3u.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
eis_stamp_c3u.menu.PartitionScheme.huge_app.build.partitions=huge_app
eis_stamp_c3u.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
eis_stamp_c3u.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
eis_stamp_c3u.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
eis_stamp_c3u.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
eis_stamp_c3u.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
eis_stamp_c3u.menu.PartitionScheme.fatflash.build.partitions=ffat
eis_stamp_c3u.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
eis_stamp_c3u.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
eis_stamp_c3u.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
eis_stamp_c3u.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
eis_stamp_c3u.menu.PartitionScheme.rainmaker=RainMaker
eis_stamp_c3u.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
eis_stamp_c3u.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

eis_stamp_c3u.menu.CPUFreq.160=160MHz (WiFi)
eis_stamp_c3u.menu.CPUFreq.160.build.f_cpu=160000000L
eis_stamp_c3u.menu.CPUFreq.80=80MHz (WiFi)
eis_stamp_c3u.menu.CPUFreq.80.build.f_cpu=80000000L
eis_stamp_c3u.menu.CPUFreq.40=40MHz
eis_stamp_c3u.menu.CPUFreq.40.build.f_cpu=40000000L
eis_stamp_c3u.menu.CPUFreq.20=20MHz
eis_stamp_c3u.menu.CPUFreq.20.build.f_cpu=20000000L
eis_stamp_c3u.menu.CPUFreq.10=10MHz
eis_stamp_c3u.menu.CPUFreq.10.build.f_cpu=10000000L

eis_stamp_c3u.menu.FlashMode.qio=QIO
eis_stamp_c3u.menu.FlashMode.qio.build.flash_mode=dio
eis_stamp_c3u.menu.FlashMode.qio.build.boot=qio
eis_stamp_c3u.menu.FlashMode.dio=DIO
eis_stamp_c3u.menu.FlashMode.dio.build.flash_mode=dio
eis_stamp_c3u.menu.FlashMode.dio.build.boot=dio
eis_stamp_c3u.menu.FlashMode.qout=QOUT
eis_stamp_c3u.menu.FlashMode.qout.build.flash_mode=dout
eis_stamp_c3u.menu.FlashMode.qout.build.boot=qout
eis_stamp_c3u.menu.FlashMode.dout=DOUT
eis_stamp_c3u.menu.FlashMode.dout.build.flash_mode=dout
eis_stamp_c3u.menu.FlashMode.dout.build.boot=dout

