ecoins1994/0010_GitHub_EIS/RT_HW_0100_Library/RT_HW_00_BASE_v1.70_01.01.24/src/BASE_000_Reference/0120_C++_board.txt/0104_ESP32_board.txt/boards.txt
eis_stamp_c3u.menu.FlashFreq.80=80MHz
eis_stamp_c3u.menu.FlashFreq.80.build.flash_freq=80m
eis_stamp_c3u.menu.FlashFreq.40=40MHz
eis_stamp_c3u.menu.FlashFreq.40.build.flash_freq=40m

eis_stamp_c3u.menu.FlashSize.4M=4MB (32Mb)
eis_stamp_c3u.menu.FlashSize.4M.build.flash_size=4MB
eis_stamp_c3u.menu.FlashSize.8M=8MB (64Mb)
eis_stamp_c3u.menu.FlashSize.8M.build.flash_size=8MB
eis_stamp_c3u.menu.FlashSize.8M.build.partitions=default_8MB
eis_stamp_c3u.menu.FlashSize.2M=2MB (16Mb)
eis_stamp_c3u.menu.FlashSize.2M.build.flash_size=2MB
eis_stamp_c3u.menu.FlashSize.2M.build.partitions=minimal
eis_stamp_c3u.menu.FlashSize.16M=16MB (128Mb)
eis_stamp_c3u.menu.FlashSize.16M.build.flash_size=16MB

eis_stamp_c3u.menu.UploadSpeed.921600=921600
eis_stamp_c3u.menu.UploadSpeed.921600.upload.speed=921600
eis_stamp_c3u.menu.UploadSpeed.115200=115200
eis_stamp_c3u.menu.UploadSpeed.115200.upload.speed=115200
eis_stamp_c3u.menu.UploadSpeed.256000.windows=256000
eis_stamp_c3u.menu.UploadSpeed.256000.upload.speed=256000
eis_stamp_c3u.menu.UploadSpeed.230400.windows.upload.speed=256000
eis_stamp_c3u.menu.UploadSpeed.230400=230400
eis_stamp_c3u.menu.UploadSpeed.230400.upload.speed=230400
eis_stamp_c3u.menu.UploadSpeed.460800.linux=460800
eis_stamp_c3u.menu.UploadSpeed.460800.macosx=460800
eis_stamp_c3u.menu.UploadSpeed.460800.upload.speed=460800
eis_stamp_c3u.menu.UploadSpeed.512000.windows=512000
eis_stamp_c3u.menu.UploadSpeed.512000.upload.speed=512000

eis_stamp_c3u.menu.DebugLevel.none=None
eis_stamp_c3u.menu.DebugLevel.none.build.code_debug=0
eis_stamp_c3u.menu.DebugLevel.error=Error
eis_stamp_c3u.menu.DebugLevel.error.build.code_debug=1
eis_stamp_c3u.menu.DebugLevel.warn=Warn
eis_stamp_c3u.menu.DebugLevel.warn.build.code_debug=2
eis_stamp_c3u.menu.DebugLevel.info=Info
eis_stamp_c3u.menu.DebugLevel.info.build.code_debug=3
eis_stamp_c3u.menu.DebugLevel.debug=Debug
eis_stamp_c3u.menu.DebugLevel.debug.build.code_debug=4
eis_stamp_c3u.menu.DebugLevel.verbose=Verbose
eis_stamp_c3u.menu.DebugLevel.verbose.build.code_debug=5

eis_stamp_c3u.menu.EraseFlash.none=Disabled
eis_stamp_c3u.menu.EraseFlash.none.upload.erase_cmd=
eis_stamp_c3u.menu.EraseFlash.all=Enabled
eis_stamp_c3u.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
#           	ESP32C3 TTGO T-OI PLUS EIS
##############################################################
ttgo-t-oi-eis.name=ESP32C3 TTGO T-OI PLUS EIS

ttgo-t-oi-eis.bootloader.tool=esptool_py
ttgo-t-oi-eis.bootloader.tool.default=esptool_py

ttgo-t-oi-eis.upload.tool=esptool_py
ttgo-t-oi-eis.upload.tool.default=esptool_py
ttgo-t-oi-eis.upload.tool.network=esp_ota

ttgo-t-oi-eis.upload.maximum_size=1310720
ttgo-t-oi-eis.upload.maximum_data_size=327680
ttgo-t-oi-eis.upload.flags=
ttgo-t-oi-eis.upload.extra_flags=

ttgo-t-oi-eis.serial.disableDTR=false
ttgo-t-oi-eis.serial.disableRTS=false

ttgo-t-oi-eis.build.tarch=riscv32
ttgo-t-oi-eis.build.target=esp
ttgo-t-oi-eis.build.mcu=esp32c3
ttgo-t-oi-eis.build.core=esp32
ttgo-t-oi-eis.build.variant=esp32c3
ttgo-t-oi-eis.build.board=ESP32C3_TTGO_T_OI_PLUS_EIS
ttgo-t-oi-eis.build.bootloader_addr=0x0

ttgo-t-oi-eis.build.cdc_on_boot=0
ttgo-t-oi-eis.build.f_cpu=160000000L
ttgo-t-oi-eis.build.flash_size=4MB
ttgo-t-oi-eis.build.flash_freq=80m
ttgo-t-oi-eis.build.flash_mode=qio
ttgo-t-oi-eis.build.boot=qio
ttgo-t-oi-eis.build.partitions=default
ttgo-t-oi-eis.build.defines=

ttgo-t-oi-eis.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
ttgo-t-oi-eis.menu.PartitionScheme.default.build.partitions=default
ttgo-t-oi-eis.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
ttgo-t-oi-eis.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
ttgo-t-oi-eis.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
ttgo-t-oi-eis.menu.PartitionScheme.minimal.build.partitions=minimal
ttgo-t-oi-eis.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
ttgo-t-oi-eis.menu.PartitionScheme.no_ota.build.partitions=no_ota
ttgo-t-oi-eis.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ttgo-t-oi-eis.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
ttgo-t-oi-eis.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
ttgo-t-oi-eis.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
ttgo-t-oi-eis.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
ttgo-t-oi-eis.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
ttgo-t-oi-eis.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
ttgo-t-oi-eis.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
ttgo-t-oi-eis.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
ttgo-t-oi-eis.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
ttgo-t-oi-eis.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
ttgo-t-oi-eis.menu.PartitionScheme.huge_app.build.partitions=huge_app
ttgo-t-oi-eis.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
ttgo-t-oi-eis.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
ttgo-t-oi-eis.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ttgo-t-oi-eis.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

ttgo-t-oi-eis.menu.CPUFreq.160=160MHz (WiFi)
ttgo-t-oi-eis.menu.CPUFreq.160.build.f_cpu=160000000L
ttgo-t-oi-eis.menu.CPUFreq.80=80MHz (WiFi)
ttgo-t-oi-eis.menu.CPUFreq.80.build.f_cpu=80000000L
ttgo-t-oi-eis.menu.CPUFreq.40=40MHz
ttgo-t-oi-eis.menu.CPUFreq.40.build.f_cpu=40000000L
ttgo-t-oi-eis.menu.CPUFreq.20=20MHz
ttgo-t-oi-eis.menu.CPUFreq.20.build.f_cpu=20000000L
ttgo-t-oi-eis.menu.CPUFreq.10=10MHz
ttgo-t-oi-eis.menu.CPUFreq.10.build.f_cpu=10000000L

ttgo-t-oi-eis.menu.FlashMode.qio=QIO
ttgo-t-oi-eis.menu.FlashMode.qio.build.flash_mode=dio
ttgo-t-oi-eis.menu.FlashMode.qio.build.boot=qio
ttgo-t-oi-eis.menu.FlashMode.dio=DIO
ttgo-t-oi-eis.menu.FlashMode.dio.build.flash_mode=dio
ttgo-t-oi-eis.menu.FlashMode.dio.build.boot=dio
ttgo-t-oi-eis.menu.FlashMode.qout=QOUT
ttgo-t-oi-eis.menu.FlashMode.qout.build.flash_mode=dout
ttgo-t-oi-eis.menu.FlashMode.qout.build.boot=qout
ttgo-t-oi-eis.menu.FlashMode.dout=DOUT
ttgo-t-oi-eis.menu.FlashMode.dout.build.flash_mode=dout
ttgo-t-oi-eis.menu.FlashMode.dout.build.boot=dout

ttgo-t-oi-eis.menu.FlashFreq.80=80MHz
ttgo-t-oi-eis.menu.FlashFreq.80.build.flash_freq=80m
ttgo-t-oi-eis.menu.FlashFreq.40=40MHz
ttgo-t-oi-eis.menu.FlashFreq.40.build.flash_freq=40m

ttgo-t-oi-eis.menu.FlashSize.4M=4MB (32Mb)
ttgo-t-oi-eis.menu.FlashSize.4M.build.flash_size=4MB

ttgo-t-oi-eis.menu.UploadSpeed.921600=921600
ttgo-t-oi-eis.menu.UploadSpeed.921600.upload.speed=921600
ttgo-t-oi-eis.menu.UploadSpeed.115200=115200
ttgo-t-oi-eis.menu.UploadSpeed.115200.upload.speed=115200
ttgo-t-oi-eis.menu.UploadSpeed.256000.windows=256000
ttgo-t-oi-eis.menu.UploadSpeed.256000.upload.speed=256000
ttgo-t-oi-eis.menu.UploadSpeed.230400.windows.upload.speed=256000
ttgo-t-oi-eis.menu.UploadSpeed.230400=230400
ttgo-t-oi-eis.menu.UploadSpeed.230400.upload.speed=230400
ttgo-t-oi-eis.menu.UploadSpeed.460800.linux=460800
ttgo-t-oi-eis.menu.UploadSpeed.460800.macosx=460800
ttgo-t-oi-eis.menu.UploadSpeed.460800.upload.speed=460800
ttgo-t-oi-eis.menu.UploadSpeed.512000.windows=512000
ttgo-t-oi-eis.menu.UploadSpeed.512000.upload.speed=512000

ttgo-t-oi-eis.menu.DebugLevel.none=None
ttgo-t-oi-eis.menu.DebugLevel.none.build.code_debug=0
ttgo-t-oi-eis.menu.DebugLevel.error=Error
ttgo-t-oi-eis.menu.DebugLevel.error.build.code_debug=1
ttgo-t-oi-eis.menu.DebugLevel.warn=Warn
ttgo-t-oi-eis.menu.DebugLevel.warn.build.code_debug=2
ttgo-t-oi-eis.menu.DebugLevel.info=Info
ttgo-t-oi-eis.menu.DebugLevel.info.build.code_debug=3
ttgo-t-oi-eis.menu.DebugLevel.debug=Debug
ttgo-t-oi-eis.menu.DebugLevel.debug.build.code_debug=4
ttgo-t-oi-eis.menu.DebugLevel.verbose=Verbose
ttgo-t-oi-eis.menu.DebugLevel.verbose.build.code_debug=5

ttgo-t-oi-eis.menu.EraseFlash.none=Disabled
ttgo-t-oi-eis.menu.EraseFlash.none.upload.erase_cmd=
ttgo-t-oi-eis.menu.EraseFlash.all=Enabled
ttgo-t-oi-eis.menu.EraseFlash.all.upload.erase_cmd=-e

