ecoins1994/0010_GitHub_EIS/RT_HW_0100_Library/RT_HW_00_BASE_v1.70_01.01.24/src/BASE_000_Reference/0120_C++_board.txt/0104_ESP32_board.txt/boards.txt
luatos-usb-eis.menu.DebugLevel.none=None
luatos-usb-eis.menu.DebugLevel.none.build.code_debug=0
luatos-usb-eis.menu.DebugLevel.error=Error
luatos-usb-eis.menu.DebugLevel.error.build.code_debug=1
luatos-usb-eis.menu.DebugLevel.warn=Warn
luatos-usb-eis.menu.DebugLevel.warn.build.code_debug=2
luatos-usb-eis.menu.DebugLevel.info=Info
luatos-usb-eis.menu.DebugLevel.info.build.code_debug=3
luatos-usb-eis.menu.DebugLevel.debug=Debug
luatos-usb-eis.menu.DebugLevel.debug.build.code_debug=4
luatos-usb-eis.menu.DebugLevel.verbose=Verbose
luatos-usb-eis.menu.DebugLevel.verbose.build.code_debug=5

luatos-usb-eis.menu.EraseFlash.none=Disabled
luatos-usb-eis.menu.EraseFlash.none.upload.erase_cmd=
luatos-usb-eis.menu.EraseFlash.all=Enabled
luatos-usb-eis.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
#						ESP32C3 LuatOS Classic EIS
##############################################################
luatos-classic-eis.name=ESP32C3 LuatOS Classic EIS
luatos-classic-eis.vid.0=0x303a
luatos-classic-eis.pid.0=0x1001

luatos-classic-eis.bootloader.tool=esptool_py
luatos-classic-eis.bootloader.tool.default=esptool_py

luatos-classic-eis.upload.tool=esptool_py
luatos-classic-eis.upload.tool.default=esptool_py
luatos-classic-eis.upload.tool.network=esp_ota

luatos-classic-eis.upload.maximum_size=1310720
luatos-classic-eis.upload.maximum_data_size=327680
luatos-classic-eis.upload.flags=
luatos-classic-eis.upload.extra_flags=
luatos-classic-eis.upload.use_1200bps_touch=false
luatos-classic-eis.upload.wait_for_upload_port=false

luatos-classic-eis.serial.disableDTR=false
luatos-classic-eis.serial.disableRTS=false

luatos-classic-eis.build.tarch=riscv32
luatos-classic-eis.build.target=esp
luatos-classic-eis.build.mcu=esp32c3
luatos-classic-eis.build.core=esp32
luatos-classic-eis.build.variant=esp32c3
luatos-classic-eis.build.board=ESP32C3_LUATOS_CLASSIC_EIS
luatos-classic-eis.build.bootloader_addr=0x0

luatos-classic-eis.build.cdc_on_boot=0
luatos-classic-eis.build.f_cpu=160000000L
luatos-classic-eis.build.flash_size=4MB
luatos-classic-eis.build.flash_freq=80m
luatos-classic-eis.build.flash_mode=qio
luatos-classic-eis.build.boot=qio
luatos-classic-eis.build.partitions=default
luatos-classic-eis.build.defines=

luatos-classic-eis.menu.CDCOnBoot.default=Disabled
luatos-classic-eis.menu.CDCOnBoot.default.build.cdc_on_boot=0
luatos-classic-eis.menu.CDCOnBoot.cdc=Enabled
luatos-classic-eis.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

luatos-classic-eis.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
luatos-classic-eis.menu.PartitionScheme.default.build.partitions=default
luatos-classic-eis.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
luatos-classic-eis.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
luatos-classic-eis.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
luatos-classic-eis.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
luatos-classic-eis.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
luatos-classic-eis.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
luatos-classic-eis.menu.PartitionScheme.minimal.build.partitions=minimal
luatos-classic-eis.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
luatos-classic-eis.menu.PartitionScheme.no_ota.build.partitions=no_ota
luatos-classic-eis.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
luatos-classic-eis.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
luatos-classic-eis.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
luatos-classic-eis.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
luatos-classic-eis.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
luatos-classic-eis.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
luatos-classic-eis.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
luatos-classic-eis.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
luatos-classic-eis.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
luatos-classic-eis.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
luatos-classic-eis.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
luatos-classic-eis.menu.PartitionScheme.huge_app.build.partitions=huge_app
luatos-classic-eis.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
luatos-classic-eis.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
luatos-classic-eis.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
luatos-classic-eis.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
luatos-classic-eis.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
luatos-classic-eis.menu.PartitionScheme.fatflash.build.partitions=ffat
luatos-classic-eis.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
luatos-classic-eis.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
luatos-classic-eis.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
luatos-classic-eis.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
luatos-classic-eis.menu.PartitionScheme.rainmaker=RainMaker
luatos-classic-eis.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
luatos-classic-eis.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

luatos-classic-eis.menu.CPUFreq.160=160MHz (WiFi)
luatos-classic-eis.menu.CPUFreq.160.build.f_cpu=160000000L
luatos-classic-eis.menu.CPUFreq.80=80MHz (WiFi)
luatos-classic-eis.menu.CPUFreq.80.build.f_cpu=80000000L
luatos-classic-eis.menu.CPUFreq.40=40MHz
luatos-classic-eis.menu.CPUFreq.40.build.f_cpu=40000000L
luatos-classic-eis.menu.CPUFreq.20=20MHz
luatos-classic-eis.menu.CPUFreq.20.build.f_cpu=20000000L
luatos-classic-eis.menu.CPUFreq.10=10MHz
luatos-classic-eis.menu.CPUFreq.10.build.f_cpu=10000000L

#luatos-classic-eis.menu.FlashMode.qio=QIO
#luatos-classic-eis.menu.FlashMode.qio.build.flash_mode=dio
#luatos-classic-eis.menu.FlashMode.qio.build.boot=qio
luatos-classic-eis.menu.FlashMode.dio=DIO
luatos-classic-eis.menu.FlashMode.dio.build.flash_mode=dio
luatos-classic-eis.menu.FlashMode.dio.build.boot=dio
#luatos-classic-eis.menu.FlashMode.qout=QOUT
#luatos-classic-eis.menu.FlashMode.qout.build.flash_mode=dout
#luatos-classic-eis.menu.FlashMode.qout.build.boot=qout
#luatos-classic-eis.menu.FlashMode.dout=DOUT
#luatos-classic-eis.menu.FlashMode.dout.build.flash_mode=dout
#luatos-classic-eis.menu.FlashMode.dout.build.boot=dout

luatos-classic-eis.menu.FlashFreq.80=80MHz
luatos-classic-eis.menu.FlashFreq.80.build.flash_freq=80m
luatos-classic-eis.menu.FlashFreq.40=40MHz
luatos-classic-eis.menu.FlashFreq.40.build.flash_freq=40m

luatos-classic-eis.menu.FlashSize.4M=4MB (32Mb)
luatos-classic-eis.menu.FlashSize.4M.build.flash_size=4MB
luatos-classic-eis.menu.FlashSize.8M=8MB (64Mb)
luatos-classic-eis.menu.FlashSize.8M.build.flash_size=8MB
luatos-classic-eis.menu.FlashSize.8M.build.partitions=default_8MB
luatos-classic-eis.menu.FlashSize.2M=2MB (16Mb)
luatos-classic-eis.menu.FlashSize.2M.build.flash_size=2MB
luatos-classic-eis.menu.FlashSize.2M.build.partitions=minimal
luatos-classic-eis.menu.FlashSize.16M=16MB (128Mb)
luatos-classic-eis.menu.FlashSize.16M.build.flash_size=16MB

luatos-classic-eis.menu.UploadSpeed.921600=921600
luatos-classic-eis.menu.UploadSpeed.921600.upload.speed=921600
luatos-classic-eis.menu.UploadSpeed.115200=115200
luatos-classic-eis.menu.UploadSpeed.115200.upload.speed=115200
luatos-classic-eis.menu.UploadSpeed.256000.windows=256000
luatos-classic-eis.menu.UploadSpeed.256000.upload.speed=256000
luatos-classic-eis.menu.UploadSpeed.230400.windows.upload.speed=256000
luatos-classic-eis.menu.UploadSpeed.230400=230400
luatos-classic-eis.menu.UploadSpeed.230400.upload.speed=230400
luatos-classic-eis.menu.UploadSpeed.460800.linux=460800
luatos-classic-eis.menu.UploadSpeed.460800.macosx=460800
luatos-classic-eis.menu.UploadSpeed.460800.upload.speed=460800
luatos-classic-eis.menu.UploadSpeed.512000.windows=512000
luatos-classic-eis.menu.UploadSpeed.512000.upload.speed=512000

