ecoins1994/0010_GitHub_EIS/RT_HW_0100_Library/RT_HW_00_BASE_v1.70_01.01.24/src/BASE_000_Reference/0120_C++_board.txt/0104_ESP32_board.txt/boards.txt
luatos-classic-eis.menu.DebugLevel.none=None
luatos-classic-eis.menu.DebugLevel.none.build.code_debug=0
luatos-classic-eis.menu.DebugLevel.error=Error
luatos-classic-eis.menu.DebugLevel.error.build.code_debug=1
luatos-classic-eis.menu.DebugLevel.warn=Warn
luatos-classic-eis.menu.DebugLevel.warn.build.code_debug=2
luatos-classic-eis.menu.DebugLevel.info=Info
luatos-classic-eis.menu.DebugLevel.info.build.code_debug=3
luatos-classic-eis.menu.DebugLevel.debug=Debug
luatos-classic-eis.menu.DebugLevel.debug.build.code_debug=4
luatos-classic-eis.menu.DebugLevel.verbose=Verbose
luatos-classic-eis.menu.DebugLevel.verbose.build.code_debug=5

luatos-classic-eis.menu.EraseFlash.none=Disabled
luatos-classic-eis.menu.EraseFlash.none.upload.erase_cmd=
luatos-classic-eis.menu.EraseFlash.all=Enabled
luatos-classic-eis.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
#					ESP32 PICO-D4
##############################################################
pico32.name=ESP32 PICO-D4

pico32.bootloader.tool=esptool_py
pico32.bootloader.tool.default=esptool_py

pico32.upload.tool=esptool_py
pico32.upload.tool.default=esptool_py
pico32.upload.tool.network=esp_ota

pico32.upload.maximum_size=1310720
pico32.upload.maximum_data_size=327680
pico32.upload.flags=
pico32.upload.extra_flags=

pico32.serial.disableDTR=true
pico32.serial.disableRTS=true

pico32.build.tarch=xtensa
pico32.build.bootloader_addr=0x1000
pico32.build.target=esp32
pico32.build.mcu=esp32
pico32.build.core=esp32
pico32.build.variant=pico32
pico32.build.board=ESP32_PICO

pico32.build.f_cpu=240000000L
pico32.build.flash_size=4MB
pico32.build.flash_freq=80m
pico32.build.flash_mode=dio
pico32.build.boot=dio
pico32.build.partitions=default
pico32.build.defines=

pico32.menu.PartitionScheme.default=Default
pico32.menu.PartitionScheme.default.build.partitions=default
pico32.menu.PartitionScheme.no_ota=No OTA (Large APP)
pico32.menu.PartitionScheme.no_ota.build.partitions=no_ota
pico32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
pico32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
pico32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
pico32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

pico32.menu.UploadSpeed.921600=921600
pico32.menu.UploadSpeed.921600.upload.speed=921600
pico32.menu.UploadSpeed.115200=115200
pico32.menu.UploadSpeed.115200.upload.speed=115200
pico32.menu.UploadSpeed.256000.windows=256000
pico32.menu.UploadSpeed.256000.upload.speed=256000
pico32.menu.UploadSpeed.230400.windows.upload.speed=256000
pico32.menu.UploadSpeed.230400=230400
pico32.menu.UploadSpeed.230400.upload.speed=230400
pico32.menu.UploadSpeed.460800.linux=460800
pico32.menu.UploadSpeed.460800.macosx=460800
pico32.menu.UploadSpeed.460800.upload.speed=460800
pico32.menu.UploadSpeed.512000.windows=512000
pico32.menu.UploadSpeed.512000.upload.speed=512000

pico32.menu.DebugLevel.none=None
pico32.menu.DebugLevel.none.build.code_debug=0
pico32.menu.DebugLevel.error=Error
pico32.menu.DebugLevel.error.build.code_debug=1
pico32.menu.DebugLevel.warn=Warn
pico32.menu.DebugLevel.warn.build.code_debug=2
pico32.menu.DebugLevel.info=Info
pico32.menu.DebugLevel.info.build.code_debug=3
pico32.menu.DebugLevel.debug=Debug
pico32.menu.DebugLevel.debug.build.code_debug=4
pico32.menu.DebugLevel.verbose=Verbose
pico32.menu.DebugLevel.verbose.build.code_debug=5

pico32.menu.EraseFlash.none=Disabled
pico32.menu.EraseFlash.none.upload.erase_cmd=
pico32.menu.EraseFlash.all=Enabled
pico32.menu.EraseFlash.all.upload.erase_cmd=-e


##############################################################
#						ESP32S2 Dev Module
##############################################################
esp32s2.name=ESP32S2 Dev Module
esp32s2.vid.0=0x303a
esp32s2.pid.0=0x0002

esp32s2.bootloader.tool=esptool_py
esp32s2.bootloader.tool.default=esptool_py

esp32s2.upload.tool=esptool_py
esp32s2.upload.tool.default=esptool_py
esp32s2.upload.tool.network=esp_ota

esp32s2.upload.maximum_size=1310720
esp32s2.upload.maximum_data_size=327680
esp32s2.upload.flags=
esp32s2.upload.extra_flags=
esp32s2.upload.use_1200bps_touch=false
esp32s2.upload.wait_for_upload_port=false

esp32s2.serial.disableDTR=false
esp32s2.serial.disableRTS=false

esp32s2.build.tarch=xtensa
esp32s2.build.bootloader_addr=0x1000
esp32s2.build.target=esp32s2
esp32s2.build.mcu=esp32s2
esp32s2.build.core=esp32
esp32s2.build.variant=esp32s2
esp32s2.build.board=ESP32S2_DEV

esp32s2.build.cdc_on_boot=0
esp32s2.build.msc_on_boot=0
esp32s2.build.dfu_on_boot=0
esp32s2.build.f_cpu=240000000L
esp32s2.build.flash_size=4MB
esp32s2.build.flash_freq=80m
esp32s2.build.flash_mode=dio
esp32s2.build.boot=qio
esp32s2.build.partitions=default
esp32s2.build.defines=

esp32s2.menu.CDCOnBoot.default=Disabled
esp32s2.menu.CDCOnBoot.default.build.cdc_on_boot=0
esp32s2.menu.CDCOnBoot.cdc=Enabled
esp32s2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

esp32s2.menu.MSCOnBoot.default=Disabled
esp32s2.menu.MSCOnBoot.default.build.msc_on_boot=0
esp32s2.menu.MSCOnBoot.msc=Enabled
esp32s2.menu.MSCOnBoot.msc.build.msc_on_boot=1

esp32s2.menu.DFUOnBoot.default=Disabled
esp32s2.menu.DFUOnBoot.default.build.dfu_on_boot=0
esp32s2.menu.DFUOnBoot.dfu=Enabled
esp32s2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

esp32s2.menu.UploadMode.default=UART0
esp32s2.menu.UploadMode.default.upload.use_1200bps_touch=false
esp32s2.menu.UploadMode.default.upload.wait_for_upload_port=false
esp32s2.menu.UploadMode.cdc=Internal USB
esp32s2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
esp32s2.menu.UploadMode.cdc.upload.wait_for_upload_port=true

esp32s2.menu.PSRAM.disabled=Disabled
esp32s2.menu.PSRAM.disabled.build.defines=
esp32s2.menu.PSRAM.enabled=Enabled
esp32s2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM

esp32s2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32s2.menu.PartitionScheme.default.build.partitions=default
esp32s2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32s2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32s2.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
esp32s2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
esp32s2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
esp32s2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32s2.menu.PartitionScheme.minimal.build.partitions=minimal
esp32s2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32s2.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32s2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32s2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32s2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32s2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32s2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32s2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32s2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32s2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32s2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32s2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
esp32s2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32s2.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32s2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32s2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32s2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32s2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32s2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
esp32s2.menu.PartitionScheme.fatflash.build.partitions=ffat
esp32s2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
esp32s2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
esp32s2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
esp32s2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
esp32s2.menu.PartitionScheme.rainmaker=RainMaker
esp32s2.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
esp32s2.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

esp32s2.menu.CPUFreq.240=240MHz (WiFi)
esp32s2.menu.CPUFreq.240.build.f_cpu=240000000L
esp32s2.menu.CPUFreq.160=160MHz (WiFi)
esp32s2.menu.CPUFreq.160.build.f_cpu=160000000L
esp32s2.menu.CPUFreq.80=80MHz (WiFi)
esp32s2.menu.CPUFreq.80.build.f_cpu=80000000L
esp32s2.menu.CPUFreq.40=40MHz
esp32s2.menu.CPUFreq.40.build.f_cpu=40000000L
esp32s2.menu.CPUFreq.20=20MHz
esp32s2.menu.CPUFreq.20.build.f_cpu=20000000L
esp32s2.menu.CPUFreq.10=10MHz
esp32s2.menu.CPUFreq.10.build.f_cpu=10000000L

esp32s2.menu.FlashMode.qio=QIO
esp32s2.menu.FlashMode.qio.build.flash_mode=dio
esp32s2.menu.FlashMode.qio.build.boot=qio
esp32s2.menu.FlashMode.dio=DIO
esp32s2.menu.FlashMode.dio.build.flash_mode=dio
esp32s2.menu.FlashMode.dio.build.boot=dio
esp32s2.menu.FlashMode.qout=QOUT
esp32s2.menu.FlashMode.qout.build.flash_mode=dout
esp32s2.menu.FlashMode.qout.build.boot=qout
esp32s2.menu.FlashMode.dout=DOUT
esp32s2.menu.FlashMode.dout.build.flash_mode=dout
esp32s2.menu.FlashMode.dout.build.boot=dout

esp32s2.menu.FlashFreq.80=80MHz
esp32s2.menu.FlashFreq.80.build.flash_freq=80m
esp32s2.menu.FlashFreq.40=40MHz
esp32s2.menu.FlashFreq.40.build.flash_freq=40m

