ecoins1994/0010_GitHub_EIS/RT_HW_0100_Library/RT_HW_00_BASE_v1.70_01.01.24/src/BASE_000_Reference/0120_C++_board.txt/0104_ESP32_board.txt/boards.txt
esp32c3.menu.FlashSize.4M=4MB (32Mb)
esp32c3.menu.FlashSize.4M.build.flash_size=4MB
esp32c3.menu.FlashSize.8M=8MB (64Mb)
esp32c3.menu.FlashSize.8M.build.flash_size=8MB
esp32c3.menu.FlashSize.8M.build.partitions=default_8MB
esp32c3.menu.FlashSize.2M=2MB (16Mb)
esp32c3.menu.FlashSize.2M.build.flash_size=2MB
esp32c3.menu.FlashSize.2M.build.partitions=minimal
esp32c3.menu.FlashSize.16M=16MB (128Mb)
esp32c3.menu.FlashSize.16M.build.flash_size=16MB

esp32c3.menu.UploadSpeed.921600=921600
esp32c3.menu.UploadSpeed.921600.upload.speed=921600
esp32c3.menu.UploadSpeed.115200=115200
esp32c3.menu.UploadSpeed.115200.upload.speed=115200
esp32c3.menu.UploadSpeed.256000.windows=256000
esp32c3.menu.UploadSpeed.256000.upload.speed=256000
esp32c3.menu.UploadSpeed.230400.windows.upload.speed=256000
esp32c3.menu.UploadSpeed.230400=230400
esp32c3.menu.UploadSpeed.230400.upload.speed=230400
esp32c3.menu.UploadSpeed.460800.linux=460800
esp32c3.menu.UploadSpeed.460800.macosx=460800
esp32c3.menu.UploadSpeed.460800.upload.speed=460800
esp32c3.menu.UploadSpeed.512000.windows=512000
esp32c3.menu.UploadSpeed.512000.upload.speed=512000

esp32c3.menu.DebugLevel.none=None
esp32c3.menu.DebugLevel.none.build.code_debug=0
esp32c3.menu.DebugLevel.error=Error
esp32c3.menu.DebugLevel.error.build.code_debug=1
esp32c3.menu.DebugLevel.warn=Warn
esp32c3.menu.DebugLevel.warn.build.code_debug=2
esp32c3.menu.DebugLevel.info=Info
esp32c3.menu.DebugLevel.info.build.code_debug=3
esp32c3.menu.DebugLevel.debug=Debug
esp32c3.menu.DebugLevel.debug.build.code_debug=4
esp32c3.menu.DebugLevel.verbose=Verbose
esp32c3.menu.DebugLevel.verbose.build.code_debug=5

esp32c3.menu.EraseFlash.none=Disabled
esp32c3.menu.EraseFlash.none.upload.erase_cmd=
esp32c3.menu.EraseFlash.all=Enabled
esp32c3.menu.EraseFlash.all.upload.erase_cmd=-e



##############################################################

ttgo-lora32.name=TTGO LoRa32-OLED

ttgo-lora32.bootloader.tool=esptool_py
ttgo-lora32.bootloader.tool.default=esptool_py

ttgo-lora32.upload.tool=esptool_py
ttgo-lora32.upload.tool.default=esptool_py
ttgo-lora32.upload.tool.network=esp_ota

ttgo-lora32.upload.maximum_size=1310720
ttgo-lora32.upload.maximum_data_size=294912
ttgo-lora32.upload.flags=
ttgo-lora32.upload.extra_flags=

ttgo-lora32.serial.disableDTR=true
ttgo-lora32.serial.disableRTS=true

ttgo-lora32.build.tarch=xtensa
ttgo-lora32.build.bootloader_addr=0x1000
ttgo-lora32.build.target=esp32
ttgo-lora32.build.mcu=esp32
ttgo-lora32.build.core=esp32
ttgo-lora32.build.board=TTGO_LoRa32

ttgo-lora32.menu.Revision.TTGO_LoRa32_V1=TTGO LoRa32 V1 (No TFCard)
ttgo-lora32.menu.Revision.TTGO_LoRa32_V1.build.board=TTGO_LoRa32_V1
ttgo-lora32.menu.Revision.TTGO_LoRa32_V1.build.variant=ttgo-lora32-v1

ttgo-lora32.menu.Revision.TTGO_LoRa32_V2=TTGO LoRa32 V2
ttgo-lora32.menu.Revision.TTGO_LoRa32_V2.build.board=TTGO_LoRa32_V2
ttgo-lora32.menu.Revision.TTGO_LoRa32_V2.build.variant=ttgo-lora32-v2

ttgo-lora32.menu.Revision.TTGO_LoRa32_v21new=TTGO LoRa32 V2.1 (1.6.1)
ttgo-lora32.menu.Revision.TTGO_LoRa32_v21new.build.board=TTGO_LoRa32_v21new
ttgo-lora32.menu.Revision.TTGO_LoRa32_v21new.build.variant=ttgo-lora32-v21new

ttgo-lora32.build.f_cpu=240000000L
ttgo-lora32.build.flash_mode=dio
ttgo-lora32.build.flash_size=4MB
ttgo-lora32.build.boot=dio
ttgo-lora32.build.partitions=default

ttgo-lora32.menu.FlashFreq.80=80MHz
ttgo-lora32.menu.FlashFreq.80.build.flash_freq=80m
ttgo-lora32.menu.FlashFreq.40=40MHz
ttgo-lora32.menu.FlashFreq.40.build.flash_freq=40m

ttgo-lora32.menu.UploadSpeed.921600=921600
ttgo-lora32.menu.UploadSpeed.921600.upload.speed=921600
ttgo-lora32.menu.UploadSpeed.115200=115200
ttgo-lora32.menu.UploadSpeed.115200.upload.speed=115200
ttgo-lora32.menu.UploadSpeed.256000.windows=256000
ttgo-lora32.menu.UploadSpeed.256000.upload.speed=256000
ttgo-lora32.menu.UploadSpeed.230400.windows.upload.speed=256000
ttgo-lora32.menu.UploadSpeed.230400=230400
ttgo-lora32.menu.UploadSpeed.230400.upload.speed=230400
ttgo-lora32.menu.UploadSpeed.460800.linux=460800
ttgo-lora32.menu.UploadSpeed.460800.macosx=460800
ttgo-lora32.menu.UploadSpeed.460800.upload.speed=460800
ttgo-lora32.menu.UploadSpeed.512000.windows=512000
ttgo-lora32.menu.UploadSpeed.512000.upload.speed=512000

ttgo-lora32.menu.DebugLevel.none=None
ttgo-lora32.menu.DebugLevel.none.build.code_debug=0
ttgo-lora32.menu.DebugLevel.error=Error
ttgo-lora32.menu.DebugLevel.error.build.code_debug=1
ttgo-lora32.menu.DebugLevel.warn=Warn
ttgo-lora32.menu.DebugLevel.warn.build.code_debug=2
ttgo-lora32.menu.DebugLevel.info=Info
ttgo-lora32.menu.DebugLevel.info.build.code_debug=3
ttgo-lora32.menu.DebugLevel.debug=Debug
ttgo-lora32.menu.DebugLevel.debug.build.code_debug=4
ttgo-lora32.menu.DebugLevel.verbose=Verbose
ttgo-lora32.menu.DebugLevel.verbose.build.code_debug=5

ttgo-lora32.menu.EraseFlash.none=Disabled
ttgo-lora32.menu.EraseFlash.none.upload.erase_cmd=
ttgo-lora32.menu.EraseFlash.all=Enabled
ttgo-lora32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

ttgo-t1.name=TTGO T1

ttgo-t1.bootloader.tool=esptool_py
ttgo-t1.bootloader.tool.default=esptool_py

ttgo-t1.upload.tool=esptool_py
ttgo-t1.upload.tool.default=esptool_py
ttgo-t1.upload.tool.network=esp_ota

ttgo-t1.upload.maximum_size=1310720
ttgo-t1.upload.maximum_data_size=327680
ttgo-t1.upload.flags=
ttgo-t1.upload.extra_flags=

ttgo-t1.serial.disableDTR=true
ttgo-t1.serial.disableRTS=true

ttgo-t1.build.tarch=xtensa
ttgo-t1.build.bootloader_addr=0x1000
ttgo-t1.build.target=esp32
ttgo-t1.build.mcu=esp32
ttgo-t1.build.core=esp32
ttgo-t1.build.variant=ttgo-t1
ttgo-t1.build.board=TTGO_T1

ttgo-t1.build.f_cpu=240000000L
ttgo-t1.build.flash_size=4MB
ttgo-t1.build.flash_freq=40m
ttgo-t1.build.flash_mode=dio
ttgo-t1.build.boot=dio
ttgo-t1.build.partitions=default
ttgo-t1.build.defines=

ttgo-t1.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
ttgo-t1.menu.PartitionScheme.default.build.partitions=default
ttgo-t1.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
ttgo-t1.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
ttgo-t1.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
ttgo-t1.menu.PartitionScheme.minimal.build.partitions=minimal
ttgo-t1.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
ttgo-t1.menu.PartitionScheme.no_ota.build.partitions=no_ota
ttgo-t1.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
ttgo-t1.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
ttgo-t1.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
ttgo-t1.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
ttgo-t1.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
ttgo-t1.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
ttgo-t1.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
ttgo-t1.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
ttgo-t1.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
ttgo-t1.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
ttgo-t1.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
ttgo-t1.menu.PartitionScheme.huge_app.build.partitions=huge_app
ttgo-t1.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
ttgo-t1.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
ttgo-t1.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
ttgo-t1.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

ttgo-t1.menu.CPUFreq.240=240MHz (WiFi/BT)
ttgo-t1.menu.CPUFreq.240.build.f_cpu=240000000L
ttgo-t1.menu.CPUFreq.160=160MHz (WiFi/BT)
ttgo-t1.menu.CPUFreq.160.build.f_cpu=160000000L
ttgo-t1.menu.CPUFreq.80=80MHz (WiFi/BT)
ttgo-t1.menu.CPUFreq.80.build.f_cpu=80000000L
ttgo-t1.menu.CPUFreq.40=40MHz (40MHz XTAL)
ttgo-t1.menu.CPUFreq.40.build.f_cpu=40000000L
ttgo-t1.menu.CPUFreq.26=26MHz (26MHz XTAL)
ttgo-t1.menu.CPUFreq.26.build.f_cpu=26000000L
ttgo-t1.menu.CPUFreq.20=20MHz (40MHz XTAL)
ttgo-t1.menu.CPUFreq.20.build.f_cpu=20000000L
ttgo-t1.menu.CPUFreq.13=13MHz (26MHz XTAL)
ttgo-t1.menu.CPUFreq.13.build.f_cpu=13000000L
ttgo-t1.menu.CPUFreq.10=10MHz (40MHz XTAL)
ttgo-t1.menu.CPUFreq.10.build.f_cpu=10000000L

ttgo-t1.menu.FlashMode.qio=QIO
ttgo-t1.menu.FlashMode.qio.build.flash_mode=dio
ttgo-t1.menu.FlashMode.qio.build.boot=qio
ttgo-t1.menu.FlashMode.dio=DIO
ttgo-t1.menu.FlashMode.dio.build.flash_mode=dio
ttgo-t1.menu.FlashMode.dio.build.boot=dio
ttgo-t1.menu.FlashMode.qout=QOUT
ttgo-t1.menu.FlashMode.qout.build.flash_mode=dout
ttgo-t1.menu.FlashMode.qout.build.boot=qout
ttgo-t1.menu.FlashMode.dout=DOUT
ttgo-t1.menu.FlashMode.dout.build.flash_mode=dout
ttgo-t1.menu.FlashMode.dout.build.boot=dout

ttgo-t1.menu.FlashFreq.80=80MHz
ttgo-t1.menu.FlashFreq.80.build.flash_freq=80m
ttgo-t1.menu.FlashFreq.40=40MHz
ttgo-t1.menu.FlashFreq.40.build.flash_freq=40m

ttgo-t1.menu.FlashSize.4M=4MB (32Mb)
ttgo-t1.menu.FlashSize.4M.build.flash_size=4MB
ttgo-t1.menu.FlashSize.2M=2MB (16Mb)
ttgo-t1.menu.FlashSize.2M.build.flash_size=2MB
ttgo-t1.menu.FlashSize.2M.build.partitions=minimal
ttgo-t1.menu.FlashSize.16M=16MB (128Mb)
ttgo-t1.menu.FlashSize.16M.build.flash_size=16MB
ttgo-t1.menu.FlashSize.16M.build.partitions=ffat

ttgo-t1.menu.UploadSpeed.921600=921600
ttgo-t1.menu.UploadSpeed.921600.upload.speed=921600
ttgo-t1.menu.UploadSpeed.115200=115200
ttgo-t1.menu.UploadSpeed.115200.upload.speed=115200
ttgo-t1.menu.UploadSpeed.256000.windows=256000
ttgo-t1.menu.UploadSpeed.256000.upload.speed=256000
ttgo-t1.menu.UploadSpeed.230400.windows.upload.speed=256000
ttgo-t1.menu.UploadSpeed.230400=230400
ttgo-t1.menu.UploadSpeed.230400.upload.speed=230400
ttgo-t1.menu.UploadSpeed.460800.linux=460800
ttgo-t1.menu.UploadSpeed.460800.macosx=460800
ttgo-t1.menu.UploadSpeed.460800.upload.speed=460800
ttgo-t1.menu.UploadSpeed.512000.windows=512000
ttgo-t1.menu.UploadSpeed.512000.upload.speed=512000

ttgo-t1.menu.DebugLevel.none=None
ttgo-t1.menu.DebugLevel.none.build.code_debug=0
ttgo-t1.menu.DebugLevel.error=Error
ttgo-t1.menu.DebugLevel.error.build.code_debug=1
ttgo-t1.menu.DebugLevel.warn=Warn
ttgo-t1.menu.DebugLevel.warn.build.code_debug=2
ttgo-t1.menu.DebugLevel.info=Info
ttgo-t1.menu.DebugLevel.info.build.code_debug=3
ttgo-t1.menu.DebugLevel.debug=Debug
ttgo-t1.menu.DebugLevel.debug.build.code_debug=4
ttgo-t1.menu.DebugLevel.verbose=Verbose
ttgo-t1.menu.DebugLevel.verbose.build.code_debug=5

ttgo-t1.menu.EraseFlash.none=Disabled
ttgo-t1.menu.EraseFlash.none.upload.erase_cmd=
ttgo-t1.menu.EraseFlash.all=Enabled
ttgo-t1.menu.EraseFlash.all.upload.erase_cmd=-e

