ecoins1994/0010_GitHub_EIS/RT_HW_0100_Library/RT_HW_00_BASE_v1.70_01.01.24/src/BASE_000_Reference/0120_C++_board.txt/0104_ESP32_board.txt/boards.txt
bananaPi_s3.bootloader.tool=esptool_py
bananaPi_s3.bootloader.tool.default=esptool_py

bananaPi_s3.upload.tool=esptool_py
bananaPi_s3.upload.tool.default=esptool_py
bananaPi_s3.upload.tool.network=esp_ota

bananaPi_s3.upload.maximum_size=1310720
bananaPi_s3.upload.maximum_data_size=327680
bananaPi_s3.upload.flags=
bananaPi_s3.upload.extra_flags=
bananaPi_s3.upload.use_1200bps_touch=false
bananaPi_s3.upload.wait_for_upload_port=false

bananaPi_s3.serial.disableDTR=false
bananaPi_s3.serial.disableRTS=false

bananaPi_s3.build.tarch=xtensa
bananaPi_s3.build.bootloader_addr=0x0
bananaPi_s3.build.target=esp32s3
bananaPi_s3.build.mcu=esp32s3
bananaPi_s3.build.core=esp32
bananaPi_s3.build.variant=esp32s3
bananaPi_s3.build.board=BANANA_PI_PICO_W_S3

bananaPi_s3.build.usb_mode=1
bananaPi_s3.build.cdc_on_boot=0
bananaPi_s3.build.msc_on_boot=0
bananaPi_s3.build.dfu_on_boot=0
bananaPi_s3.build.f_cpu=240000000L
bananaPi_s3.build.flash_size=4MB
bananaPi_s3.build.flash_freq=80m
bananaPi_s3.build.flash_mode=dio
bananaPi_s3.build.boot=qio
bananaPi_s3.build.boot_freq=80m
bananaPi_s3.build.partitions=default
bananaPi_s3.build.defines=
bananaPi_s3.build.loop_core=
bananaPi_s3.build.event_core=
bananaPi_s3.build.psram_type=qspi
bananaPi_s3.build.memory_type={build.boot}_{build.psram_type}

bananaPi_s3.menu.PSRAM.disabled=Disabled
bananaPi_s3.menu.PSRAM.disabled.build.defines=
bananaPi_s3.menu.PSRAM.disabled.build.psram_type=qspi
bananaPi_s3.menu.PSRAM.enabled=QSPI PSRAM
bananaPi_s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
bananaPi_s3.menu.PSRAM.enabled.build.psram_type=qspi
bananaPi_s3.menu.PSRAM.opi=OPI PSRAM
bananaPi_s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
bananaPi_s3.menu.PSRAM.opi.build.psram_type=opi

bananaPi_s3.menu.FlashMode.qio=QIO 80MHz
bananaPi_s3.menu.FlashMode.qio.build.flash_mode=dio
bananaPi_s3.menu.FlashMode.qio.build.boot=qio
bananaPi_s3.menu.FlashMode.qio.build.boot_freq=80m
bananaPi_s3.menu.FlashMode.qio.build.flash_freq=80m
bananaPi_s3.menu.FlashMode.qio120=QIO 120MHz
bananaPi_s3.menu.FlashMode.qio120.build.flash_mode=dio
bananaPi_s3.menu.FlashMode.qio120.build.boot=qio
bananaPi_s3.menu.FlashMode.qio120.build.boot_freq=120m
bananaPi_s3.menu.FlashMode.qio120.build.flash_freq=80m
bananaPi_s3.menu.FlashMode.dio=DIO 80MHz
bananaPi_s3.menu.FlashMode.dio.build.flash_mode=dio
bananaPi_s3.menu.FlashMode.dio.build.boot=dio
bananaPi_s3.menu.FlashMode.dio.build.boot_freq=80m
bananaPi_s3.menu.FlashMode.dio.build.flash_freq=80m
bananaPi_s3.menu.FlashMode.opi=OPI 80MHz
bananaPi_s3.menu.FlashMode.opi.build.flash_mode=dout
bananaPi_s3.menu.FlashMode.opi.build.boot=opi
bananaPi_s3.menu.FlashMode.opi.build.boot_freq=80m
bananaPi_s3.menu.FlashMode.opi.build.flash_freq=80m

bananaPi_s3.menu.FlashSize.4M=4MB (32Mb)
bananaPi_s3.menu.FlashSize.4M.build.flash_size=4MB
bananaPi_s3.menu.FlashSize.8M=8MB (64Mb)
bananaPi_s3.menu.FlashSize.8M.build.flash_size=8MB
bananaPi_s3.menu.FlashSize.8M.build.partitions=default_8MB
bananaPi_s3.menu.FlashSize.16M=16MB (128Mb)
bananaPi_s3.menu.FlashSize.16M.build.flash_size=16MB
#bananaPi_s3.menu.FlashSize.32M=32MB (256Mb)
#bananaPi_s3.menu.FlashSize.32M.build.flash_size=32MB

bananaPi_s3.menu.LoopCore.1=Core 1
bananaPi_s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
bananaPi_s3.menu.LoopCore.0=Core 0
bananaPi_s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

bananaPi_s3.menu.EventsCore.1=Core 1
bananaPi_s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
bananaPi_s3.menu.EventsCore.0=Core 0
bananaPi_s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

bananaPi_s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
bananaPi_s3.menu.USBMode.hwcdc.build.usb_mode=1
bananaPi_s3.menu.USBMode.default=USB-OTG (TinyUSB)
bananaPi_s3.menu.USBMode.default.build.usb_mode=0

bananaPi_s3.menu.CDCOnBoot.default=Disabled
bananaPi_s3.menu.CDCOnBoot.default.build.cdc_on_boot=0
bananaPi_s3.menu.CDCOnBoot.cdc=Enabled
bananaPi_s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

bananaPi_s3.menu.MSCOnBoot.default=Disabled
bananaPi_s3.menu.MSCOnBoot.default.build.msc_on_boot=0
bananaPi_s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
bananaPi_s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

bananaPi_s3.menu.DFUOnBoot.default=Disabled
bananaPi_s3.menu.DFUOnBoot.default.build.dfu_on_boot=0
bananaPi_s3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
bananaPi_s3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

bananaPi_s3.menu.UploadMode.default=UART0 / Hardware CDC
bananaPi_s3.menu.UploadMode.default.upload.use_1200bps_touch=false
bananaPi_s3.menu.UploadMode.default.upload.wait_for_upload_port=false
bananaPi_s3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
bananaPi_s3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
bananaPi_s3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

bananaPi_s3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
bananaPi_s3.menu.PartitionScheme.default.build.partitions=default
bananaPi_s3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
bananaPi_s3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
bananaPi_s3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
bananaPi_s3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
bananaPi_s3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
bananaPi_s3.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
bananaPi_s3.menu.PartitionScheme.minimal.build.partitions=minimal
bananaPi_s3.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
bananaPi_s3.menu.PartitionScheme.no_ota.build.partitions=no_ota
bananaPi_s3.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
bananaPi_s3.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
bananaPi_s3.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
bananaPi_s3.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
bananaPi_s3.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
bananaPi_s3.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
bananaPi_s3.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
bananaPi_s3.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
bananaPi_s3.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
bananaPi_s3.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
bananaPi_s3.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
bananaPi_s3.menu.PartitionScheme.huge_app.build.partitions=huge_app
bananaPi_s3.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
bananaPi_s3.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
bananaPi_s3.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
bananaPi_s3.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
bananaPi_s3.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
bananaPi_s3.menu.PartitionScheme.fatflash.build.partitions=ffat
bananaPi_s3.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
bananaPi_s3.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
bananaPi_s3.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
bananaPi_s3.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
bananaPi_s3.menu.PartitionScheme.rainmaker=RainMaker
bananaPi_s3.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
bananaPi_s3.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

bananaPi_s3.menu.CPUFreq.240=240MHz (WiFi)
bananaPi_s3.menu.CPUFreq.240.build.f_cpu=240000000L
bananaPi_s3.menu.CPUFreq.160=160MHz (WiFi)
bananaPi_s3.menu.CPUFreq.160.build.f_cpu=160000000L
bananaPi_s3.menu.CPUFreq.80=80MHz (WiFi)
bananaPi_s3.menu.CPUFreq.80.build.f_cpu=80000000L
bananaPi_s3.menu.CPUFreq.40=40MHz
bananaPi_s3.menu.CPUFreq.40.build.f_cpu=40000000L
bananaPi_s3.menu.CPUFreq.20=20MHz
bananaPi_s3.menu.CPUFreq.20.build.f_cpu=20000000L
bananaPi_s3.menu.CPUFreq.10=10MHz
bananaPi_s3.menu.CPUFreq.10.build.f_cpu=10000000L

bananaPi_s3.menu.UploadSpeed.921600=921600
bananaPi_s3.menu.UploadSpeed.921600.upload.speed=921600
bananaPi_s3.menu.UploadSpeed.115200=115200
bananaPi_s3.menu.UploadSpeed.115200.upload.speed=115200
bananaPi_s3.menu.UploadSpeed.256000.windows=256000
bananaPi_s3.menu.UploadSpeed.256000.upload.speed=256000
bananaPi_s3.menu.UploadSpeed.230400.windows.upload.speed=256000
bananaPi_s3.menu.UploadSpeed.230400=230400
bananaPi_s3.menu.UploadSpeed.230400.upload.speed=230400
bananaPi_s3.menu.UploadSpeed.460800.linux=460800
bananaPi_s3.menu.UploadSpeed.460800.macosx=460800
bananaPi_s3.menu.UploadSpeed.460800.upload.speed=460800
bananaPi_s3.menu.UploadSpeed.512000.windows=512000
bananaPi_s3.menu.UploadSpeed.512000.upload.speed=512000

bananaPi_s3.menu.DebugLevel.none=None
bananaPi_s3.menu.DebugLevel.none.build.code_debug=0
bananaPi_s3.menu.DebugLevel.error=Error
bananaPi_s3.menu.DebugLevel.error.build.code_debug=1
bananaPi_s3.menu.DebugLevel.warn=Warn
bananaPi_s3.menu.DebugLevel.warn.build.code_debug=2
bananaPi_s3.menu.DebugLevel.info=Info
bananaPi_s3.menu.DebugLevel.info.build.code_debug=3
bananaPi_s3.menu.DebugLevel.debug=Debug
bananaPi_s3.menu.DebugLevel.debug.build.code_debug=4
bananaPi_s3.menu.DebugLevel.verbose=Verbose
bananaPi_s3.menu.DebugLevel.verbose.build.code_debug=5

bananaPi_s3.menu.EraseFlash.none=Disabled
bananaPi_s3.menu.EraseFlash.none.upload.erase_cmd=
bananaPi_s3.menu.EraseFlash.all=Enabled
bananaPi_s3.menu.EraseFlash.all.upload.erase_cmd=-e


##############################################################
##############################################################
##############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
###############################################################
